[
  "",
  "*Complete the  on any machine.",
  "200/row",
  "4 rope climbs to",
  "Active Shoulders: The Foundation of Safe and Strong Movement in CrossFit",
  "Alternating dumbbell snatches",
  "An Invitation to the 2026 Worldwide CrossFit Open",
  "Back Squats Are Not the Enemy",
  "Breaking Through Squat Plateaus (Without Abandoning CrossFit)",
  "Bring Back the Jump Rope: The Simple Tool You're Probably Ignoring",
  "Build to a 1  max snatch",
  "Calorie row",
  "Creatine is back in the spotlight with impressive research on physical and cognitive benefits and yes, it works. But if you're agonizing over whether to take 3 or 5 grams while grabbing Taco Bell before your workout, you're having the wrong conversation entirely.",
  "Creatine: Everything You Need To Know (And Why Your Diet Matters More)",
  "CrossFit includes the bench press less than almost any other training program, but that doesn't mean you should skip it entirely. When done correctly as part of a comprehensive program, the bench press builds raw upper body strength and works your back more than you think. You just need to know the technical details that turn it into a true full body movement.",
  "CrossFit.com",
  "Echo bike",
  "Find a gym near you:",
  "For time and total :",
  "For time:",
  "Friday 251219",
  "Friday 251226",
  "Friday 260102",
  "Friday 260109",
  "Friday 260116",
  "GHD sit ups",
  "Grace",
  "Hidalgo",
  "If you've got a 20 lb vest or body armor, wear it.",
  "Isabel",
  "L sit hold",
  "Lateral burpees over the rower",
  "Loading...",
  "Monday 251222",
  "Monday 251229",
  "Monday 260105",
  "Monday 260112",
  "Most people overdevelop their quads, but the glutes, hamstrings, and erectors are our actual performance engine, and if you haven't learned to \"wire your brain to your ass,\" you're leaving serious power on the table and setting yourself up for potential injuries. The paradox: those deadlifts and squats so many are afraid will hurt their backs are exactly what their backs need to feel better.",
  "Open Workout 20.2",
  "Perform this workout like the \"12 Days of Christmas\" song. In Round 1, perform 1 wall walk. In Round 2, perform 2 candlestick rocks, then 1 wall walk. In Round 3, perform 3 burpees, 2 candlestick rocks, and 1 wall walk. Continue adding a new exercise each round.",
  "Post  to comments.",
  "Post all three times to comments.",
  "Post the total number of double unders and burpees completed and the time to complete the workout to comments.",
  "Post total  to comments.",
  "Post total time and load to comments.",
  "Post your best lift to comments.",
  "Push press 5 5 3 3 3 1 1 1 1",
  "Rest",
  "Rest Day",
  "Rest between efforts.",
  "Rest between rounds.",
  "Run 2 miles",
  "Russian kettlebell swings",
  "Saturday 251220",
  "Saturday 251227",
  "Saturday 260103",
  "Saturday 260110",
  "Saturday 260117",
  "Sunday 251221",
  "Sunday 251228",
  "Sunday 260104",
  "Sunday 260111",
  "The AbMat: Why This Simple Tool Changes Everything About Sit Ups",
  "The Bench Press in CrossFit: Why You Should Do It (And How To Do It Right)",
  "The CAP team creates data driven programming, class plans, daily coaching development tools, and logistical support for CrossFit affiliates. Visit crossfit.com/programming for more about CAP’s offerings, including daily workouts, comprehensive class plans, scaling options, warm ups, timelines, bonus competitors programming, movement demos, and educational resources.",
  "The CrossFit Open is more than a test of fitness it’s a challenge that builds mental toughness, resilience, and confidence. While it provides valuable insights into our progress, it also forces us to perform under pressure, face our fears, and push beyond our comfort zone. Whether it’s conquering a tough movement, racing the clock, or battling self doubt, the Open is our chance to choose growth over fear and walk away stronger, fitter, and prouder. This year, embrace the challenge do the hard thing and make it count.",
  "Then, on a clock, complete:",
  "Thursday 251218",
  "Thursday 251225",
  "Thursday 260101",
  "Thursday 260108",
  "Thursday 260115",
  "Tuesday 251223",
  "Tuesday 251230",
  "Tuesday 260106",
  "Tuesday 260113",
  "U.S. Army First Lieutenant Daren M. Hidalgo, 24, of Waukesha, Wisconsin, assigned to 3rd Squadron, 2nd Stryker Cavalry Regiment, based in Vilseck, Germany, died on Feb. 20, 2011, in Kandahar province, Afghanistan, from wounds suffered when insurgents attacked his unit with an improvised explosive device. Two weeks before his death, he was hit by an earlier explosive device. Despite his injuries, he stayed in country and on patrols rather than return home. He is survived by his father Jorge, mother Andrea, brothers, Miles and Jared, and sister Carmen.",
  "View the CrossFit map",
  "Wednesday 251224",
  "Wednesday 251231",
  "Wednesday 260107",
  "Wednesday 260114",
  "When experts recommend replacing back squats with single leg movements to avoid pain, they're treating the symptom, not the cause. Back squats are an essential functional movement that builds capacity across all aspects of fitness. When they cause pain, the solution isn't to abandon them but to scale the load, fix your technique, and address gaps in your overall program. For lifelong health and fitness, the answer is simple: squat more, more often.",
  "Without an AbMat, your abs stop working dynamically about a third of the way through a sit up and become stabilizers while your hip flexors take over. This simple piece of foam does something that nothing else replicates: it lets your abs work through their full range of motion, eliminating the weak range many people ignore. Your AbMat gives you a training stimulus that complements everything else you do in the gym and in life.",
  "You said you'd do of jump rope and quit at 5, which means you just rediscovered what boxers and wrestlers never forgot: this simple tool will humble you and get you in serious shape. While most of our work with the jump rope shows up as double unders in a workout, the single under is a seriously legitimate conditioning implement that builds cardiovascular capacity, develops lower leg resilience, and strengthens footwork and coordination with minimal impact. The irony: if you want better double unders,",
  "Your Performance Engine: Why the Posterior Chain Matters",
  "Your back squat is stuck, and you think you need to abandon CrossFit for a 12 week specialized strength program. Here's the truth: you can break through that plateau with simple adjustments right within your regular training.",
  "Your shoulder isn't actually a ball and socket joint; it's more like a golf ball on a tee, which means it needs to be actively locked in when supporting load. If you've been doing push ups, planks, or overhead movements without understanding active shoulders, you're probably doing them wrong and missing out on both safety and performance gains. This one concept applies to nearly every upper body movement you do in CrossFit, and understanding it changes everything.",
  "air squats",
  "barbell, 20 inch box, 25 lb plate",
  "barbell, 24 inch box, 45 lb plate",
  "box jump overs",
  "box jumps",
  "box step ups",
  "broad jumps",
  "burpees",
  "candlestick rocks",
  "chest to bar pull ups",
  "clean and jerks",
  "deadlifts",
  "double unders",
  "dumbbell bench presses",
  "dumbbell farmers carry",
  "dumbbell thrusters",
  "dumbbells and a 20 inch box",
  "dumbbells and a 24 inch box",
  "for time of:",
  "hand release push ups",
  "handstand hold",
  "handstand push ups",
  "handstand walk",
  "jumping lunges",
  "jumping squats",
  "kettlebell Turkish get ups, left arm",
  "kettlebell Turkish get ups, right arm",
  "kettlebell goblet squats",
  "knees to elbows",
  "medicine ball to a target",
  "of burpees",
  "of double unders",
  "overhead walking lunges with a plate",
  "plank hold",
  "pull ups",
  "push ups",
  "ring push ups",
  "row",
  "row*",
  "run",
  "sandbag bear hug carry",
  "single leg squats",
  "sit ups",
  "snatches",
  "squat cleans",
  "strict handstand push ups",
  "strict ring dips",
  "thrusters",
  "to create a shared experience for the community. This month we will prioritize improving technique and efficiency for movements often seen in the CrossFit Open!",
  "toes to bars",
  "walking lunges",
  "wall ball shots",
  "wall walk",
  "♀ 20 inch box",
  "♂ 24 inch box"
]